[
  {
    "name": "Sukanta Hui",
    "title": "Head of Software Training & Mentorship",
    "image": "teacher1.jpg",
    "bio": "Sukanta Hui is a seasoned full-stack developer and programming expert with over 20 years of experience guiding learners from beginner to professional level. With deep expertise in modern programming languages and software development, he has mentored engineers from diverse organizations and guided countless B.Tech and M.Tech students throughout their academic and professional journeys. Beyond technical mastery, Sukanta is a passionate educator with vast insight into the education system, a dedicated career guide, and a motivational speaker who inspires future technologists to achieve excellence. A true problem solver at heart, he continues to shape the next generation of software engineers through his mentorship and leadership.",
    "email": "sukanta.hui@codernaccotax.co.in"
  },
  {
    "name": "Tanusree Hui",
    "title": "Data Structures & Algorithms Mentor",
    "image": "teacher2.jpg",
    "bio": "Tanusree is an ex-Google engineer who specializes in competitive programming and interview prep.",
    "email": "tanusree.hui@codernaccotax.co.in"
  },
  {
    "name": "Chandan Das",
    "title": "Data Analytics and Taxation Expert",
    "image": "teacher3.jpg",
    "bio": "Chandan has 15+ years of experience in taxation and data analytics for small and large businesses.",
    "email": "chandan.das@codernaccotax.co.in"
  },
  {
    "name": "Sreeparna Das",
    "title": "Data Structures and Algorithms",
    "image": "teacher4.jpg",
    "bio": "Sreeparna simplifies complex DSA topics and focuses on logic building with hands-on coding sessions.",
    "email": "sreeparna.das@codernaccotax.co.in"
  },
  {
    "name": "Mounita Bhandari",
    "title": "Lab Instructor",
    "image": "teacher5.jpg",
    "bio": "Mounita ensures practical knowledge through lab-based learning, supporting students step-by-step.",
    "email": "mounita.bhandari@codernaccotax.co.in"
  },
  {
    "name": "Ritaja Ghosh",
    "title": "Lab Instructor",
    "image": "teacher6.jpg",
    "bio": "Ritaja guides students in lab sessions with patience and precision, helping them gain real-world skills. She encourages hands-on practice and ensures every student is confident with the tools.",
    "email": "ritaja.ghosh@codernaccotax.co.in"
  }
]
